# CannotMirrorLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..CannotMirrorLoad Property
BuiltInFailures..::..LoadFailures Class See Also
---
Can't mirror Load because mirror plane is not perpendicular to sketch plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMirrorLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMirrorLoad As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMirrorLoad {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace